QGDsolver/tutorials/reactingQGDFoam/2D/backwardFacingStep/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         table
        (
            (0    (0      0 0))
            (0.05 (9.778  0 0))
            (0.1  (18.527 0 0))
            (0.15 (26.247 0 0))
            (0.2  (32.937 0 0))
            (0.25 (38.598 0 0))
            (0.3  (43.230 0 0))
            (0.35 (46.832 0 0))
            (0.4  (49.406 0 0))
            (0.45 (50.949 0 0))
            (0.5  (51.464 0 0))
            (0.55 (50.949 0 0))
            (0.6  (49.406 0 0))
            (0.65 (46.832 0 0))
            (0.7  (43.230 0 0))
            (0.75 (38.593 0 0))
            (0.8  (32.937 0 0))
            (0.85 (26.247 0 0))
            (0.9  (18.527 0 0))
            (0.95 (9.778  0 0))
            (1    (0      0 0))
        );
        direction       (0 1 0);
        origin          1;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            noSlip;
    }
    symwall
    {
        type            empty;
    }
}

// ************************************************************************* //
